taskt/Core/Automation/Commands/ExcelGroup/IExcelCellProperties.dot
digraph "taskt.Core.Automation.Commands.IExcelCellProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IExcelCellProperties" [ label="IExcelCellProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelInstanceProperties" [ label="IExcelInstanceProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IExcelCellProperties" -> "taskt.Core.Automation.Commands.IExcelInstanceProperties";
"taskt.Core.Automation.Commands.IExcelInstanceProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
