taskt/Core/Automation/Commands/ExcelGroup/IExcelCellProperties.puml
@startuml
left to right direction
package "taskt.Core.Automation.Commands"{
Interface "IExcelCellProperties" {
+{abstract} v_CellLocation : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExcelInstanceProperties" {
+{abstract} v_InstanceName : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}

taskt.Core.Automation.Commands.IExcelCellProperties --|> taskt.Core.Automation.Commands.IExcelInstanceProperties
taskt.Core.Automation.Commands.IExcelInstanceProperties --|> taskt.Core.Automation.Commands.IExpandableProperties
@enduml
